module.exports = {
  All: {
    1000: '内资公司',
    2000: '内资分公司',
    3000: '内资企业法人',
    4000: '内资非法人企业、非公司私营企业及内资非公司企业分支机构',
    5000: '外商投资企业',
    6000: '台、港、澳投资企业',
    7000: '外国(地区）企业',
    8000: '集团',
    9000: '其它类型'
  },
  1000: {
    1100: '有限责任公司',
    1200: '股份有限公司'
  },
  2000: {
    2100: '有限责任公司分公司',
    2200: '股份有限公司分公司'
  },
  3000: {
    3100: '全民所有制',
    3200: '集体所有制',
    3300: '股份制',
    3400: '股份合作制',
    3500: '联营'
  },
  4000: {
    4100: '事业单位营业',
    4200: '社团法人营业',
    4300: '内资企业法人分支机构(非法人)',
    4400: '经营单位(非法人)',
    4500: '非公司私营企业',
    4600: '联营',
    4700: '股份制企业(非法人)'
  },
  5000: {
    5100: '有限责任公司',
    5200: '股份有限公司',
    5300: '非公司',
    5800: '外商投资企业分支机构'
  },
  6000: {
    6100: '有限责任公司',
    6200: '股份有限公司',
    6300: '非公司',
    6800: '台、港、澳投资企业分支机构'
  },
  7000: {
    7100: '外国(地区）公司分支机构',
    7200: '外国(地区)企业常驻代表机构',
    7300: '外国(地区)企业在中国境内从事经营活动'
  },
  9000: {
    9100: '农民专业合作经济组织',
    9200: '农民专业合作经济组织分支机构',
    9900: '其它'
  },
  1100: {
    1110: '有限责任公司(国有独资)',
    1120: '有限责任公司(外商投资企业投资)',
    1130: '有限责任公司(自然人投资或控股)',
    1140: '有限责任公司(国有控股)',
    1150: '一人有限责任公司',
    1190: '其它有限责任公司'
  },
  1200: {
    1210: '股份有限公司(上市)',
    1220: '股份有限公司(非上市)'
  },
  2100: {
    2110: '有限责任公司分公司(国有独资)',
    2120: '有限责任公司分公司(外商投资企业投资)',
    2130: '有限责任公司分公司(自然人投资或控股)',
    2140: '有限责任公司分公司(国有控股)',
    2150: '一人有限责任公司分公司',
    2190: '其它有限责任公司分公司'
  },
  2200: {
    2210: '股份有限公司分公司(上市)',
    2220: '股份有限公司分公司(非上市)'
  },
  4100: {
    4110: '国有事业单位营业',
    4120: '集体事业单位营业'
  },
  4200: {
    4210: '国有社团法人营业',
    4220: '集体社团法人营业'
  },
  4300: {
    4310: '全民所有制分支机构(非法人)',
    4320: '集体分支机构(非法人)',
    4330: '股份制分支机构',
    4340: '股份合作制分支机构'
  },
  4400: {
    4410: '国有经营单位(非法人)',
    4420: '集体经营单位(非法人)'
  },
  4500: {
    4530: '合伙企业',
    4540: '个人独资企业',
    4550: '合伙企业分支机构',
    4560: '个人独资企业分支机构'
  },
  5100: {
    5110: '有限责任公司(中外合资)',
    5120: '有限责任公司(中外合作)',
    5130: '有限责任公司(外商合资)',
    5140: '有限责任公司(外国自然人独资)',
    5150: '有限责任公司(外国法人独资)',
    5160: '有限责任公司(外国非法人经济组织独资)',
    5190: '其它'
  },
  5200: {
    5210: '股份有限公司(中外合资、未上市)',
    5220: '股份有限公司(中外合资、上市)',
    5230: '股份有限公司(外商合资、未上市)',
    5240: '股份有限公司(外商合资、上市)',
    5290: '其它'
  },
  5300: {
    5310: '非公司外商投资企业(中外合作)',
    5320: '非公司外商投资企业(外商合资)',
    5390: '其它'
  },
  5800: {
    5810: '分公司',
    5820: '非公司外商投资企业分支机构',
    5830: '办事处',
    5890: '其它'
  },
  6100: {
    6110: '有限责任公司(台港澳与境内合资)',
    6120: '有限责任公司(台港澳与境内合作)',
    6130: '有限责任公司(台港澳合资)',
    6140: '有限责任公司(台港澳自然人独资)',
    6150: '有限责任公司(台港澳法人独资)',
    6160: '有限责任公司(台港澳非法人经济组织独资)',
    6170: '有限责任公司(台港澳与外国投资者合资)',
    6190: '其它'
  },
  6200: {
    6210: '股份有限公司(台港澳与境内合资、未上市)',
    6220: '股份有限公司(台港澳与境内合资、上市)',
    6230: '股份有限公司(台港澳合资、未上市)',
    6240: '股份有限公司(台港澳合资、上市)',
    6250: '股份有限公司(台港澳与外国投资者合资、未上市)',
    6260: '股份有限公司(台港澳与外国投资者合资、上市)',
    6290: '其它'
  },
  6300: {
    6310: '非公司台、港、澳企业(台港澳与境内合作)',
    6320: '非公司台、港、澳企业(台港澳合资)',
    6390: '其它'
  },
  6800: {
    6810: '分公司',
    6820: '非公司台、港、澳投资企业分支机构',
    6830: '办事处',
    6890: '其它'
  },
  7100: {
    7110: '外国(地区)无限责任公司分支机构',
    7120: '外国(地区)有限责任公司分支机构',
    7130: '外国(地区)股份有限责任公司分支机构',
    7190: '外国(地区)其它形式公司分支机构'
  },
  7300: {
    7310: '分公司',
    7390: '其它'
  },
  1120: {
    1121: '有限责任公司(外商投资企业合资)',
    1122: '有限责任公司（外商投资企业与内资合资）',
    1123: '有限责任公司(外商投资企业法人独资)'
  },
  1150: {
    1151: '有限责任公司(自然人独资)',
    1152: '有限责任公司（法人独资）'
  },
  1210: {
    1211: '股份有限公司(上市、外商投资企业投资)',
    1212: '股份有限公司(上市、自然人投资或控股)',
    1213: '股份有限公司(上市、国有控股)',
    1219: '其它有限公司(上市)'
  },
  1220: {
    1221: '股份有限公司(非上市、外商投资企业投资)',
    1222: '股份有限公司(非上市、自然人投资或控股)',
    1223: '股份有限公司(非上市、国有控股)',
    1229: '其它股份有限公司(非上市)'
  },
  2120: {
    2121: '有限责任公司分公司(外商投资企业合资)',
    2122: '有限责任公司分公司(外商投资企业与内资合资)',
    2123: '有限责任公司分公司(外商投资企业法人独资)'
  },
  2150: {
    2151: '有限责任公司分公司(自然人独资)',
    2152: '有限责任公司分公司（法人独资）'
  },
  2210: {
    2211: '股份有限公司分公司(上市、外商投资企业投资)',
    2212: '股份有限公司分公司(上市、自然人投资或控股)',
    2213: '股份有限公司分公司(上市、国有控股)',
    2219: '其它股份有限公司分公司(上市)'
  },
  2220: {
    2221: '股份有限公司分公司(非上市、外商投资企业投资)',
    2222: '股份有限公司分公司(非上市、自然人投资或控股)',
    2223: '股份有限公司分公司(非上市、国有控股)',
    2229: '股份有限公司分公司(非上市)'
  },
  4530: {
    4531: '普通合伙企业',
    4532: '特殊普通合伙企业',
    4533: '有限合伙企业'
  },
  4550: {
    4551: '普通合伙企业分支机构',
    4552: '特殊普通合伙企业分支机构',
    4553: '有限合伙企业分支机构'
  }
}
