module.exports = {
  All: {
    1: '通用设备',
    2: '专用设备',
    3: '交通运输设备',
    4: '电子产品及通信设备',
    5: '电气设备',
    6: '土地、房屋及构筑物',
    7: '其它租赁物'
  },
  1: {
    11: '锅炉及原动机',
    12: '金属加工设备',
    13: '起重设备',
    14: '装卸设备',
    15: '其它通用设备',
  },
  2: {
    21: '工程机械',
    22: '电力设备',
    23: '纺织设备',
    24: '印刷设备',
    25: '医疗器械',
    26: '环保设备',
    27: '农林牧渔机械',
    28: '矿采设备',
    29: '冶炼设备',
    210: '炼油化工设备',
    211: '其它专用设备',

  },
  27: {
    271: '农机具',
    272: '其它农林牧渔机械'
  },
  29: {
    291: '钢铁',
    292: '有色金属',
    293: '其它冶炼设备'
  },
  3: {
    31: '飞机',
    32: '船舶',
    33: '城市交通设备',
    34: '铁路运输设备',
    35: '其它交通运输设备'
  },
  31: {
    311: '通用航空类飞机',
    312: '客运飞机',
    313: '货运运输飞机',
    314: '直升机',
    315: '其它飞机'
  },
  32: {
    321: '货船',
    322: '客船',
    323: '工程船',
    324: '其它船舶'
  },
  33: {
    331: '轨道交通',
    332: '汽车',
    333: '其它城市交通设备'
  },
  4: {
    41: '通信设备',
    42: '计算机',
    43: '其它电信设备'
  },
  6: {
    61: '土地',
    62: '房屋',
    63: '构筑物'
  },
  63: {
    631: '道路',
    632: '桥梁',
    633: '其它构筑物'
  },
}